In [1]:
import pandas as pd 
df = pd.read_csv("/home/mnetto/Documents/Python/Pandas/bank.csv", encoding= "UTF-8", sep= ";")

In [2]:
df.age.mean()

41.17009511170095

In [3]:
df.age.min()

19

In [4]:
df.age.max()

87

In [5]:
#Funções de agrupamento 
df[df.marital == "married"].age.mean()

43.45441544511977

In [6]:
#Usando o groupby
df[["marital", "age"]].groupby(["marital"]).mean()

                age
marital
divorced  45.475379
married   43.454415
single    33.927258

In [7]:
df[["marital", "education","age"]].groupby(["marital", "education"]).mean()

                          age
marital  education
divorced primary    51.392405
         secondary  43.496296
         tertiary   45.148387
         unknown    50.375000
married  primary    47.511407
         secondary  42.404345
         tertiary   41.777166
         unknown    48.444444
single   primary    37.013699
         secondary  33.052545
         tertiary   34.512821
         unknown    34.652174

In [8]:
#Média do balanço de pessoas com idade entre 30 e 50 anos, casadas e separadas
colunas = ["balance", "marital"] 
df[((df.age >= 30) & (df.age <= 50)) & (df.marital.isin(["married", "divorced"]))][colunas].groupby(["marital"]).mean()

              balance
marital
divorced   910.406877
married   1388.499231